# +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
# Предварительный анализ данных
# +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

install.packages("kernlab")

library(kernlab)
library(tidyverse)


# Функции метрики и кроссвалидации

get_metrics <- function(y_true, y_pred){
  v1 <- sum(y_true == 1 & y_pred == 1) / (sum(y_true == 1 & y_pred == 1) + sum(y_pred == 0 & y_true == 1))
  v2 <- sum(y_true == 0 & y_pred == 0) / (sum(y_true == 0 & y_pred == 0) + sum(y_pred == 1 & y_true == 0))
  return(0.5*v1 + 0.5*v2)
}


get_cross_validation <- function(df_data, train_percent){
  train_ind <- sample.int(nrow(df_data), floor(nrow(df_data) * train_percent / 100))
  return(list(train = df_data[train_ind, ], test=df_data[-train_ind, ]))
}


# Читаем и готовим данные

df_data <- read_csv("train.csv")
df_data_orig <- df_data


# df_data <- df_data_orig

colnames(df_data)


df_data$ПолNum <- ifelse(df_data$Пол == "М", 1, 0)
df_data$`Сигарет в день`[is.na(df_data$`Сигарет в день`)] <- 0
df_data$`Возраст курения`[is.na(df_data$`Возраст курения`)] <- 60
df_data$`Возраст алког`[is.na(df_data$`Возраст алког`)] <- 60
df_data$`Курит сейчас` <- df_data$`Статус Курения` == "Курит"
df_data$`Алкоголь сейчас` <- df_data$Алкоголь == "употребляю в настоящее время"
df_data <- df_data %>% filter(!is.na(Пол))
df_data$Sex <- ifelse(df_data$Пол == "М", 1, 0)


# Артериальная гипертензия


df_data$Переломы
  

best_pred <- df_data %>% 
  select(`Вы работаете?`, 
         `Сахарный диабет`, 
         `Регулярный прим лекарственных средств`,
         `Бронжиальная астма`,
         `Прекращение работы по болезни`,
         `Выход на пенсию`,
         `Хроническое заболевание легких`,
         `Травмы за год`,
         Переломы,
         `Гепатит`,
         Sex,
         `Сигарет в день`) %>% 
  map_dbl(cor, y = df_data$`Артериальная гипертензия`) %>% 
  abs %>% 
  sort(decreasing = T) %>% 
  .[1:10] %>% 
  names %>% 
  df_data[.]


cor.test(df_data$`Артериальная гипертензия`, df_data$`Хроническое заболевание легких`)


expand.grid(c(1, 2, 3), c(8, 9))


full.model <- glm(formula = `Артериальная гипертензия` ~ 
                    `Пол`
                  + `Вы работаете?`
                  + `Сахарный диабет`
                  + `Регулярный прим лекарственных средств`
                  + `Бронжиальная астма`
                  , 
                  data = df_data,
                  family = binomial())

reduced.model <- step(full.model, direction = "backward")

influence.measures(full.model)

summary(full.model)

min.model <- glm(formula = `Артериальная гипертензия` ~ 1,
                 data = df_data,
                 family = binomial())


df_data$Образование

fwd.model <- step(min.model, direction = "forward", scope = (~ (`Пол` +
                                                            `Вы работаете?` +
                                                            `Сахарный диабет` +
                                                            `Регулярный прим лекарственных средств` +
                                                            `Бронжиальная астма` +
                                                            `Гепатит` +
                                                            `Образование`)^2),
                  trace = 0)


summary(fwd.model)

df_data$`Сигарет в день`

set.seed(42)
res_vec <- c()
for (num in 1:30) {
  cv = get_cross_validation(df_data, 70)
  
  # nrow(cv$train)
  # nrow(cv$test)

  # 7.15
  fit <- glm(formula = `Артериальная гипертензия` ~
              # `Пол`
               + `Вы работаете?`
               + `Сахарный диабет`
               + `Регулярный прим лекарственных средств`
               + `Бронжиальная астма`
               + `Возраст алког`
              # + `Алкоголь сейчас`
              # + `Курит сейчас`
              # + `Возраст курения`
             # + `Сон после обеда`
             ,
             data = cv$train,
             family = binomial())


  cv$test$ag_predict <- predict(fit, cv$test, type = "response")
  
  lim <- 0.3
  cv$test$ag_predict_discr <- ifelse(cv$test$ag_predict >= lim, 1, 0)
  
  score <- get_metrics(cv$test$`Артериальная гипертензия`, cv$test$ag_predict_discr)
  print(score)
  res_vec <- c(res_vec, score)

    
  # fit <- ksvm(`Артериальная гипертензия` ~
  #               `Регулярный прим лекарственных средств`
  #               + `Выход на пенсию`
  #               + `Сахарный диабет`
  #               + `Вы работаете?`
  #               + Пол
  #               + Переломы
  #               + `Хроническое заболевание легких`
  #               + `Бронжиальная астма`
  #               + `Сон после обеда`
  #               ,
  #               data = cv$train,
  #               # kernel = "vanilladot"
  #             kernel = "rbfdot"
  #             )
  # 
  #   
  # summary(fit)
  # 
  # # cv$test$ag_predict <- predict(fit, cv$test, type = "response")
  # 
  # cv$test$ag_predict <- predict(fit, cv$test)
  # 
  # lim <- 0.5
  # cv$test$ag_predict_discr <- ifelse(cv$test$ag_predict >= lim, 1, 0)
  # 
  # 
  # score <- get_metrics(cv$test$`Артериальная гипертензия`, cv$test$ag_predict_discr)
  # print(score)
  # res_vec <- c(res_vec, score)
}

ag_mean <- mean(res_vec)
ag_mean
median(res_vec)

# train <- c(0,1,0,1,1,0,0,0,0,0,0,0,1,0,0,0,0,1,1,0,0,1,0,1,1,0,0,1,1,0,0,0,0,0,1,1,0,0,0,0,1,1,0,0,1,0,1,1,0,0,1,0,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,1,1,0,1,1,1,1,0,0,0,1,1,1,0,0,0,1,1,0,0,1,1,1,0,0,0,0,1,0,1,0,0,1,0,1,0,1,1,0,0,1,0,1,0,0,1,0,0,1,0,1,0,0,0,0,1,1,1,0,0,0,0,1,0,1,0,1,1,1,0,1,1,1,0,0,0,1,0,1,0,1,0,0,0,0,1,0,1,0,0,0,1,1,0,0,1,1,0,1,1,0,1,1,1,0,0,1,1,1,1,1,0,1,0,0,0,0,0,1,1,1,0,0,0,0,0,0,0,1,1,1,1,1,1,1,0,0,1,0,1,1,1,0,0,1,1,1,1,0,0,0,1,1,0,0,1,0,1,0,1,0,0,1,0,0,1,0,0,0,1,0,0,1,1,1,0,1,0,0,1,1,1,0,0,0,0,1,1,1,0,1,1,0,0,1,0,1,0,0,1,1,0,1,0,0,0,0,0,1,1,1,0,1,0,0,0,1,0,1,1,1,0,0,0,0,0,0,1,0,0,0,0,1,0,0,0,1,1,1,1,0,1,1,0,1,1,1,1,1,1,1,1,0,1,0,1,0,0,0,0,0,0,1,1,1,1,0,1,1,1,0,1,1,0,0,0,1,1,1,0,1,1,0,0,0,0,0,1,1,1,0,0,0,0,1,1,1,1,0,0,1,0,0,1,0,1,0,1,0,1,1,1,0,1,1,0,1,1,0,0,1,1,1,0,1,0,1,0,1,0,0,0,0,1,0,1,0,1,0,0,0,0,0,1,0,1,1,0,0,0,1,0,0,1,1,1,1,0,1,1,0,1,0,0,1,0,1,0,1,1,1,0,1,1,0,1,0,1,0,1,0,1,0,1,0,0,0,0,0,0,1,1,0,0,1,1,0,1,0,1,0,0,0,1,0,1,1,1,0,1,0,1,0,1,0,1,0,1,0,0,0,1,1,1,0,1,1,0,0,0,1,1,0,0,0,1,1,1,1,0,1,0,1,0,0,1,0,0,1,1,1,1,0,1,0,0,1,1,0,1,0,0,0,0,1,0,1,1,1,1,0,1,1,0,1,1,1,0,0,0,0,0,0,1,1,1,0,0,0,1,0,1,0,1,1,0,1,0,1,0,0,1,1,1,0,1,0,1,0,1,1,1,0,0,1,1,0,1,0,1,0,0,0,0,0,1,1,0,0,1,0,1,0,1,0,0,0,0,0,0,1,0,0,1,0,0,1,1,1,1,1,1,0,1,0,0,1,0,1,0,1,0,1,0,0,1,0,0,0,0,0,0,1,1,1,0,0,1,1,0,0,0,0,1,0,0,0,1,0,0,0,0,1,0,1,1,1,1,1,1,0,1,1,0,0,0,0,1,1,1,1,0,1,0,1,0,0,0,0,1,1,0,0,1,1,0,0,1,1,1,1,0,0,1,1,1,1,1,0,1,0,0,1,0,1,1,0,0,0,0,1,1,0,0,1,0,0,1,1,1,1,0,0,1,0,0,0,0,0,1,0,1,1,0,1,0,0,0,0,0,0,1,1,1,1,1,0,0,1,1,0,0,0,0,1,0,1,0,1,1,0,0,0,1,1,0,1,1,0,0,0,0,0,1,0,1,1,1,1,0,0,1,1,0,0,1,0,0,0,0,1,0,0,1,0,1,1,0,1,1,1,0,1,0,0,1,0,1,1,1,1,0,0,1,0,0,0,0,1,1,0,0,1,0,1,0,0,1,0,1,0,0,0,0,0,1,1,0,0,0,0,1,0,0,0,1,0,0,1,0,0,0,1,1,1,1,0,0,1,0,1,0,0,0,0,1,0,0,1,1,1,1,1,1,0,1,1,1,0,0,0,1,0,1,0,1,1,1,1,1,0,1,1,1,1,0,1,1,0,1,0,1,0,1,1,0,1,0,0,0,0,1,0,1,1,1,0,0,0,0,0,1,0,1,1,0,0,0,1,0,1,0,0,0,0,1,1,1,1,0,1,0,0,1,0,0)
# res <-  c(0,1,1,1,1,1,1,1,1,0,1,0,1,1,0,1,1,0,1,1,0,1,1,1,1,1,0,1,1,1,0,1,0,1,1,1,1,1,0,1,1,1,0,0,1,1,1,1,0,1,1,1,1,0,0,0,1,1,0,0,0,0,1,1,0,1,1,0,1,0,0,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,0,1,0,1,1,1,0,1,0,1,0,0,1,0,1,1,0,0,1,1,1,1,1,0,0,0,1,1,0,0,0,1,1,0,1,0,0,1,1,1,1,1,1,1,1,0,1,1,0,1,1,0,1,1,1,0,1,0,1,0,1,0,1,0,1,0,0,1,1,1,1,0,1,1,1,0,0,1,1,1,1,1,0,0,1,1,0,0,1,1,1,1,1,0,1,1,0,0,0,1,1,1,1,0,1,0,0,1,1,0,1,1,1,1,1,1,1,0,0,0,1,1,1,1,1,1,1,1,0,1,1,0,0,1,1,1,0,1,0,0,0,1,0,0,1,0,1,1,0,1,0,1,1,1,0,1,1,0,1,0,0,1,0,1,0,0,0,1,1,1,1,0,1,1,0,0,1,1,1,0,0,1,0,0,1,1,0,0,1,0,1,1,0,0,1,0,1,1,1,0,1,0,1,1,1,0,0,0,1,1,0,0,0,0,1,1,0,0,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,0,1,1,1,1,0,1,0,0,0,1,1,1,1,1,1,1,0,1,0,1,1,0,1,0,1,1,0,0,1,0,1,0,0,0,0,0,1,1,0,0,1,0,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,0,0,0,1,1,1,0,1,1,0,1,1,1,1,0,1,1,0,0,1,0,1,0,0,0,1,1,1,1,1,0,0,0,1,1,1,1,0,1,0,0,1,1,1,1,1,1,1,0,1,1,0,1,1,1,1,0,1,0,1,1,0,0,1,1,0,1,0,1,1,1,0,1,0,1,1,1,0,1,0,0,1,1,0,0,1,1,0,1,1,1,0,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,0,1,0,1,1,1,0,0,1,1,0,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,0,1,1,1,0,1,0,0,0,1,1,1,1,0,0,0,1,1,1,1,1,1,0,1,1,0,1,1,1,0,1,0,1,1,0,0,1,1,0,1,1,1,1,1,0,1,1,1,0,0,1,0,0,1,1,1,0,1,0,0,0,0,1,1,0,0,1,1,1,1,1,1,1,0,1,0,1,1,1,1,0,1,0,1,1,1,1,1,1,1,1,0,1,0,1,1,0,1,1,1,1,1,0,1,0,1,1,1,1,1,1,0,0,1,1,1,0,1,0,0,0,1,0,1,1,0,1,0,1,1,1,0,0,1,1,1,0,0,1,1,0,0,0,0,1,0,0,1,1,1,1,1,0,1,1,0,1,1,0,0,1,1,1,1,1,0,1,0,0,0,1,1,1,1,0,1,1,0,0,1,1,1,1,0,1,1,1,1,1,1,0,1,1,0,1,0,1,1,1,0,1,0,1,1,0,1,0,0,0,0,1,0,1,0,1,1,0,0,0,0,0,1,1,0,1,1,1,0,1,0,0,0,1,1,1,1,1,0,1,0,1,1,1,0,0,0,1,0,1,0,0,1,1,1,1,1,1,1,1,1,0,0,0,1,0,1,1,1,1,1,1,0,0,1,1,1,1,1,1,1,0,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1,0,0,1,1,0,0,1,1,1,0,0,1,0,1,1,0,1,1,1,0,1,1,0,1,1,0,1,0,1,0,1,0,0,1,1,0,1,1,0,1,0,0,1,1,1,1,1,1,1,1,0,0,1,0,1,0,1,1,1,0,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,0,1,1,1,1,0,1,0,0,1,0,1,0,1,1,1,1,0,1,0,0,1,0,1,1,1,1,1,0,1,0,1,0,1,1,0,0,1,1,0,1,1,0,1,0,1,1,0,1,0,1,0,1,1,1,0)
# get_metrics(train, res)


# ++++++++++++++++++++++++++++++++++++++++++++++++++++

# ОНМК


best_pred <- df_data %>% 
  select(`Вы работаете?`, 
         `Сахарный диабет`, 
         `Регулярный прим лекарственных средств`,
         `Бронжиальная астма`,
         `Прекращение работы по болезни`,
         `Выход на пенсию`,
         `Хроническое заболевание легких`,
         `Травмы за год`,
         Переломы,
         `Гепатит`,
         Sex,
         `Сигарет в день`) %>% 
  map_dbl(cor, y = df_data$`ОНМК`) %>% 
  abs %>% 
  sort(decreasing = T) %>% 
  .[1:10] %>% 
  names %>% 
  df_data[.]


set.seed(42)
res_vec <- c()
for (num in 1:30) {
  cv = get_cross_validation(df_data, 70)
  
  # nrow(cv$train)
  # nrow(cv$test)
  
  fit <- glm(formula = `ОНМК` ~
               # `Переломы`
               + Пол
               + `Регулярный прим лекарственных средств`
               + `Статус Курения`
               # + `Сон после обеда`
               + `Образование`
             # + `Возраст алког`
             # + `Возраст курения`
             # + `Сигарет в день`
             ,
             data = cv$train,
             family = binomial())

  summary(fit)

  cv$test$onmk_predict <- predict(fit, cv$test, type = "response")

  lim <- 0.034
  cv$test$onmk_predict_discr <- ifelse(cv$test$onmk_predict >= lim, 1, 0)

  score <- get_metrics(cv$test$`ОНМК`, cv$test$onmk_predict_discr)
  print(score)
  res_vec <- c(res_vec, score)

  

}

onmk_mean <- mean(res_vec)
onmk_mean
median(res_vec)


# ++++++++++++++++++++++++++++++++++++++++++++++++++++

# Стенокардия, ИБС, инфаркт миокарда


set.seed(42)
res_vec <- c()
for (num in 1:30) {
  cv = get_cross_validation(df_data, 70)
  
  # nrow(cv$train)
  # nrow(cv$test)
  
  fit <- glm(formula = `Стенокардия, ИБС, инфаркт миокарда` ~ 
               `Вы работаете?`
               # + Пол
               # + `Выход на пенсию`
               + `Регулярный прим лекарственных средств`
               + `Переломы`
               + `Алкоголь`
               + `Образование`
               + `Сигарет в день`
               # + `Курит сейчас`
            #  + `Возраст алког`
             # + `Сон после обеда`
             , 
             data = cv$train,
             family = binomial())
  
  summary(fit)
  
  cv$test$st_predict <- predict(fit, cv$test, type = "response")
  
  lim <- 0.098
  cv$test$st_predict_discr <- ifelse(cv$test$st_predict >= lim, 1, 0)
  
  score <- get_metrics(cv$test$`Стенокардия, ИБС, инфаркт миокарда`, cv$test$st_predict_discr)
  print(score)
  res_vec <- c(res_vec, score)
  
}


st_mean <- mean(res_vec)
st_mean
median(res_vec)


# ++++++++++++++++++++++++++++++++++++++++++++++++++++

# Сердечная недостаточность


set.seed(42)
res_vec <- c()
for (num in 1:30) {
  cv = get_cross_validation(df_data, 70)
  
  # nrow(cv$train)
  # nrow(cv$test)
  
  fit <- glm(formula = `Сердечная недостаточность` ~ 
             #  `Вы работаете?`
             # + Пол
             `Регулярный прим лекарственных средств`
             + `Выход на пенсию`
             # + `Переломы`
             # + `Алкоголь`
             + `Алкоголь сейчас`
             + `Образование`
             # + `Сигарет в день`
             , 
             data = cv$train,
             family = binomial())
  
  summary(fit)
  
  cv$test$sn_predict <- predict(fit, cv$test, type = "response")
  
  lim <- 0.091
  cv$test$sn_predict_discr <- ifelse(cv$test$sn_predict >= lim, 1, 0)
  
  score <- get_metrics(cv$test$`Сердечная недостаточность`, cv$test$sn_predict_discr)
  print(score)
  res_vec <- c(res_vec, score)
  
}


sn_mean <- mean(res_vec)
sn_mean
median(res_vec)

# ++++++++++++++++++++++++++++++++++++++++++++++++++++

# Прочие заболевания сердца
df_data$`Хроническое заболевание легких`
df_data$`Бронжиальная астма`
df_data$`Прекращение работы по болезни`


fit_ag <- glm(formula = `Артериальная гипертензия` ~
                # `Пол`
              `Вы работаете?`
              + `Сахарный диабет`
              + `Регулярный прим лекарственных средств`
              + `Бронжиальная астма`
              + `Возраст алког`
              # + `Алкоголь сейчас`
              # + `Курит сейчас`
              # + `Возраст курения`
              # + `Сон после обеда`
              ,
              data = cv$train,
              family = binomial())



df_data$ag <- predict(fit_ag, df_data, type = "response")



set.seed(42)
res_vec <- c()
for (num in 1:30) {
  cv = get_cross_validation(df_data, 70)
  
  # nrow(cv$train)
  # nrow(cv$test)
  
  fit <- glm(formula = `Прочие заболевания сердца` ~ 
             `Регулярный прим лекарственных средств`
             # + `Прекращение работы по болезни`
             + `Сон после обеда`
             + ag
             #   + `Алкоголь сейчас`               
             #   + `Курит сейчас`               
             # + `Возраст курения`
             # + `Травмы за год`
             # + `Спорт, клубы`
             # + `Сигарет в день`
             # + sn
             # + `Выход на пенсию`
             , 
             data = cv$train,
             family = binomial())
  
  summary(fit)
  
  cv$test$another_predict <- predict(fit, cv$test, type = "response")
  
  lim <- 0.1
  cv$test$another_predict_discr <- ifelse(cv$test$another_predict >= lim, 1, 0)
  
  score <- get_metrics(cv$test$`Прочие заболевания сердца`, cv$test$another_predict_discr)
  print(score)
  res_vec <- c(res_vec, score)
  
}


another_mean <- mean(res_vec)
another_mean
median(res_vec)

df_temp_1 <- df_data %>% filter(`Прочие заболевания сердца` == 1)
df_temp_0 <- df_data %>% filter(`Прочие заболевания сердца` == 0)


# ++++

df_data$obr <- as.integer(df_data$Образование == "5 - ВУЗ")
df_data$sem <- as.integer(df_data$Семья == "в разводе")
df_data$prof <- as.integer(df_data$Профессия == "дипломированные специалисты")

cor.test(df_data$`Прочие заболевания сердца`, df_data$sn, na.rm = T)

label(df_data$Этнос[1])


# ++++++++++++++++++++++++++++++++++++++++++++++++++++

(ag_mean + onmk_mean + st_mean + sn_mean + another_mean) / 5


df_test_res <- read_csv("test_dataset_test.csv")

sum(is.na(df_test_res$Пол))
